"""2. Повторяем основные конструкции языка Python. Часть 1.
На вход программе подаётся натуральное число. Напишите программу, которая вставляет в заданное число
запятые в соответствии со стандартным американским соглашением о запятых в больших числах.
"""

i = int(input())
print(f'{i:,}')
