"""2. Повторяем основные конструкции языка Python. Часть 1.
Дана строка, состоящая из слов, разделенных пробелами. Напишите программу, которая подсчитывает
количество слов в этой строке.
"""
s = input()
print(len(s.split()))
